'''Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |'''


print('Введите трехзначное число: ')
a = int(input())
sum = 0
if a > 99 and a < 1000:
    digit1 = a // 100
    digit2 = (a // 10) % 10
    digit3 = a % 10
    sum = digit1 + digit2 + digit3
    print(sum, '(', digit1, '+', digit2, '+', digit3, ')')
else:
    print('Введено некорректное число')

'''Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, 
что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

*Пример:*

6 -> 1  4  1
24 -> 4  16  4
60 -> 10  40  10'''


# print ('Введите число журавликов S: ')
# s = int(input())
# a = s // 6
# b = a * 4
# c = a
# print(a, b, c)


'''Задача 6: Вы пользуетесь общественным транспортом? 
Вероятно, вы расплачивались за проезд и получали билет с номером. 
Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость 
билета.

*Пример:*

385916 -> yes
123456 -> no'''


# print ('Введите шестизначное число: ')
# a = int(input())
# sum1 = 0
# sum2 = 0
# if a > 99999 and a < 1000000:
#     digit1 = a // 100000
#     digit2 = (a // 10000) % 10
#     digit3 = (a // 1000) % 10
#     digit4 = (a // 100) % 10
#     digit5 = (a // 10) % 10
#     digit6 = a % 10
#     sum1 = digit1 + digit2 + digit3
#     sum2 = digit4 + digit5 + digit6
#     if sum1 == sum2:
#         print ('yes')
#     else:
#         print ('no')
# else:
#     print ('Введено некорректное число')


'''Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

*Пример:*

3 2 4 -> yes
3 2 1 -> no  '''


# print ('Введите число долек n: ')
# n = int(input())
# print ('Введите число долек m: ')
# m = int(input())
# print ('Введите число долек k, которые нужно отломить: ')
# k = int(input())
# if n % k == 0 or m % k ==0:
#     print ('yes')
# else:
#     print ('no')
